"""Morse Code Translator"""
import doctest

LETTER_TO_MORSE = {
    'A': '.-', 'B': '-...', 'C': '-.-.',
    'D': '-..', 'E': '.', 'F': '..-.',
    'G': '--.', 'H': '....', 'I': '..',
    'J': '.---', 'K': '-.-', 'L': '.-..',
    'M': '--', 'N': '-.', 'O': '---',
    'P': '.--.', 'Q': '--.-', 'R': '.-.',
    'S': '...', 'T': '-', 'U': '..-',
    'V': '...-', 'W': '.--', 'X': '-..-',
    'Y': '-.--', 'Z': '--..', '1': '.----',
    '2': '..---', '3': '...--', '4': '....-',
    '5': '.....', '6': '-....', '7': '--...',
    '8': '---..', '9': '----.', '0': '-----',
    ', ': '--..--', '.': '.-.-.-', '?': '..--..',
    '/': '-..-.', '-': '-....-', '(': '-.--.', ')': '-.--.-',
    ' ': ' '
}


def encode(message):
    """
    Кодирует строку в соответсвие с таблицей азбуки Морзе
    >>> encode('MAI-PYTHON-2020') # doctest: +SKIP
    '-- .- .. -....-
    .--. -.-- - .... --- -. -....-
    ..--- ----- ..--- -----'
    >>> encode('SOS')
    '...
    ---
    ...'
    >>> encode('МАИ-ПИТОН-2020') # doctest: +ELLIPSIS
    Traceback (most recent call last):
    ...
    KeyError: 'М'
    """
    encoded_signs = [
        LETTER_TO_MORSE[letter] for letter in message
    ]

    return ' '.join(encoded_signs)


if __name__ == '__main__':
    doctest.testmod()
